000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Отделения/Отделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Отделения</name>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВесМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийМаксимальныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОтделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтделения</name>
    <type>
      <types>CatalogRef.ТипыОтделений</types>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлинна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Отделения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти отделение по номеру.
// 
// Параметры:
//  НомерОтделения - Строка - Номер отделения в виде строки
//  Город - СправочникСсылка.ГородаДоставки - Город, в которм нужно найти улицу
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.Отделения - Ссылка на город доставки
//  
Функция НайтиОтделение(НомерОтделения, Город, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Отделения.Ссылка
		|ИЗ
		|	Справочник.Отделения КАК Отделения
		|ГДЕ
		|	Отделения.ОператорДоставки = &ОператорДоставки
		|	И (Отделения.НомерОтделения = &НомерОтделения)
		|	И Отделения.Город = &Город";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("НомерОтделения", СокрЛП(Строка(НомерОтделения)));
	Запрос.УстановитьПараметр("Город", Город);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = ПустаяСсылка();

	КонецЕсли;
	
	Возврат Результат;

КонецФункции
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
